InformationRegisters/НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.ВариантАлгоритмаБюджета</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КритерииОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КритерииОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКритичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Критическая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ФормаОбщихНастроек/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСистемы.Параметр КАК Параметр,
	               |	НастройкиСистемы.Значение КАК Значение,
	               |	НастройкиСистемы.Параметр.ИмяПредопределенныхДанных КАК ПараметрИмяПредопределенныхДанных
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемы КАК НастройкиСистемы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтаФорма[ВыборкаДетальныеЗаписи.ПараметрИмяПредопределенныхДанных] = ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	Элементы.ОблачныйБэкап.Доступность = Автобэкап;
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмРасчетаБюджетаПриИзменении(Элемент)
	ОбщиеПроцедурыИФункцииСервер.УстановитьНастройки("ВариантРасчетаБюджета", ВариантРасчетаБюджета);
КонецПроцедуры

&НаКлиенте
Процедура УведомлятьОПерерасходеПриИзменении(Элемент)
	ОбщиеПроцедурыИФункцииСервер.УстановитьНастройки("УведомлятьОПревышенииБюджета", УведомлятьОПревышенииБюджета);
КонецПроцедуры

&НаКлиенте
Процедура АвтобэкапПриИзменении(Элемент)
	ОбщиеПроцедурыИФункцииСервер.УстановитьНастройки("Автобэкап", УведомлятьОПревышенииБюджета);
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОблачныйБэкапПриИзменении(Элемент)//TODO: переделать.
	ОбщиеПроцедурыИФункцииСервер.УстановитьНастройки("ОблачныйБэкап", УведомлятьОПревышенииБюджета);
	
	Массив = Новый Массив;
	Массив.Добавить("id_user");
	
	Если ОблачныйБэкап Тогда
		МассивПараметров = ОбщиеПроцедурыИФункцииСервер.ПолучитьНастройки(Массив);
		Если ЗначениеЗаполнено(МассивПараметров) Тогда
			id_user = "";
			Если МассивПараметров[0].Свойство("id_user", id_user) И Не ЗначениеЗаполнено(id_user) Тогда
				
				Текст = "Что-то пошло не так... Мы скоро всё исправим! Посмотрите способы решения проблемы в разделе ""Состояние системы""";
				ПоказатьПредупреждение(, Текст);
				Элементы.СсылкаНаРегистрацию.Видимость = Истина;
				ОблачныйБэкап = Ложь;
				
				Массив = Новый Массив;
				Массив.Добавить("User");
				МассивПараметров = ОбщиеПроцедурыИФункцииСервер.ПолучитьНастройки(Массив);
				
				Логин = "";
				Если Не ЗначениеЗаполнено(МассивПараметров) Тогда
					Логин = "Логина тоже нет в регистре!";
				Иначе
					Если МассивПараметров[0].Свойство("User", Логин) И Не ЗначениеЗаполнено(Логин) Тогда
						Логин = "Логин у пользователя тоже не заполнен в параметрах!";
					КонецЕсли;
				КонецЕсли;
				
				ТекстОшибки = СтрШаблон("У пользователя не заполнен user_id в параметрах. Логин: %1", Логин);
				ОбщиеПроцедурыИФункцииСервер.ЗаписатьЛоги(ТекстОшибки,, Истина, ПредопределенноеЗначение("Перечисление.КритерииОшибок.Критическая"));
				
			КонецЕсли;
			
		Иначе
			Текст = "Для отправки бэкапов на сервер не обходима регистрация пользователя в системе";
			ПоказатьПредупреждение(, Текст);
			Элементы.СсылкаНаРегистрацию.Видимость = Истина;
			ОблачныйБэкап = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьЛогиПриИзменении(Элемент)
	ОбщиеПроцедурыИФункцииСервер.УстановитьНастройки("ОтправлятьЛоги", УведомлятьОПревышенииБюджета);
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиОтправлятьОшибкиПриИзменении(Элемент)
	ОбщиеПроцедурыИФункцииСервер.УстановитьНастройки("АвтоматическиОтправлятьОшибки", УведомлятьОПревышенииБюджета);
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьСтатистикуПриИзменении(Элемент)
	ОбщиеПроцедурыИФункцииСервер.УстановитьНастройки("ОтправлятьСтатистику", УведомлятьОПревышенииБюджета);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаРегистрациюНажатие(Элемент, СтандартнаяОбработка)
	Форма = ПолучитьФорму("ОбщаяФорма.ФормаРегистрацииНаСервере");
	Форма.Открыть();
КонецПроцедуры
